<a href="https://colab.research.google.com/github/Sakibapon/BRAC/blob/master/PandasFinalVersion.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# CSE422: Introduction to Pandas
---

Pandas is an open source library written & used for data manipulation and analysis. In particular, it offers data structures and operations for manipulating numerical tables like a dataframe.

DataFrame is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dictionary of Series objects.

#Series : First main data type in Pandas

In [ ]:

import pandas as pd
#np.random.rand(5,6)
labels =['a','b','c']
my_data=[10,20,30]

d={'a':10,'b':10,'c':30}

In [ ]:
pd.Series(labels)

0    a
1    b
2    c
dtype: object

#DataFrame

In [ ]:

import numpy as np

x=np.random.randint(100,size=(5,4)) 

import pandas as pd
#df =pd.DataFrame(x)
df =pd.DataFrame(x,['x','b','c','d','e'],['W','X','Y','Z'])
print(df)

    W   X   Y   Z
x  53  76  54  10
b   4  99  25  72
c  38   0  13  72
d  26  44  55  97
e  87  82  13  29

In [ ]:
#Fetching data from Column
df['X']

x    76
b    99
c     0
d    44
e    82
Name: X, dtype: int64

In [ ]:
type(df['X'])

pandas.core.series.Series

In [ ]:
#ENTERING ANATHER COLUMN IN A DATAFRAME
df['xyz']=[1,2,3,4,5]
df

    W   X   Y   Z  xyz
x  53  76  54  10    1
b   4  99  25  72    2
c  38   0  13  72    3
d  26  44  55  97    4
e  87  82  13  29    5

In [ ]:
#how delete column in dataframe:
df.drop('Z',axis=1,inplace=True)
print(df)

    W   X   Y  xyz
x  53  76  54    1
b   4  99  25    2
c  38   0  13    3
d  26  44  55    4
e  87  82  13    5

In [ ]:
#we can access row by 2 ways:
# 1. location based selection
# 2. numerical based selection
df.loc['c','W']

38

In [ ]:
df.iloc[1]  #indexwise

W       4
X      99
Y      25
xyz     2
Name: b, dtype: int64

Importing pandas library and reading a CSV file into a dataframe.

In [ ]:
 df = pd.read_csv('/content/sample_data/sales.csv',index_col='month')
 df.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

# Indexing DataFrames

Indexing using square brackets

In [ ]:
 df['spam']['Mar']

72

In [ ]:
df['spam']

month
Jan    17
Feb    31
Mar    72
Apr    20
May    52
Jun    55
Name: spam, dtype: int64

In [ ]:
df.loc['Feb',:]

eggs    110.0
salt     50.0
spam     31.0
Name: Feb, dtype: float64

Using column atribute and row index/label

In [ ]:
df.salt['Apr']

87.0

Using the .loc accessor
* Access a group of rows and columns by label(s) or a boolean array.

In [ ]:
 df.loc['Jan': 'Mar', 'eggs':'spam']

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72

Using the .iloc accessor
* Purely integer-location based indexing for selection by position.

In [ ]:
 df.iloc[2:4, 2]

month
Mar    72
Apr    20
Name: spam, dtype: int64

In [ ]:
 df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

Selecting only some columns

In [ ]:
df_new = df[['salt','eggs']]
df_new

       salt  eggs
month
Jan    12.0    47
Feb    50.0   110
Mar    89.0   221
Apr    87.0    77
May     NaN   132
Jun    60.0   205

# Slicing DataFrames

Selecting a column (i.e., Series)

In [ ]:
 df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [ ]:
#printing type of the column selected
type(df['eggs'])

pandas.core.series.Series

A series is a 1D-array that can store any data type

Slicing and indexing a Series

In [ ]:
#selecting part of a series
df['eggs'][1:4]

month
Feb    110
Mar    221
Apr     77
Name: eggs, dtype: int64

In [ ]:
df['eggs'][4]

132

* LOC is not based on index. The stop limit is **not** exclusive
* ILOC is based on index. The stop limit is exclusive

In [ ]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
df.loc[:, ['eggs','salt']]   # All rows, some columns

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN
Jun     205  60.0

In [ ]:
 df.loc['Jan':'Apr',:]  # Some rows, all columns

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20

In [ ]:
df.loc['Mar':'May', 'salt':'spam']

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

In [ ]:
df.iloc[2:5, 1:] # A block from middle of the DataFrame

       salt  spam
month
Mar    89.0    72
Apr    87.0    20
May     NaN    52

Using lists rather than slices (1)

In [ ]:
df.loc['Jan':'May', ['eggs','salt']]

       eggs  salt
month
Jan      47  12.0
Feb     110  50.0
Mar     221  89.0
Apr      77  87.0
May     132   NaN

Using lists rather than slices (2)

In [ ]:
df.iloc[[0,4,5], 0:2]

       eggs  salt
month
Jan      47  12.0
May     132   NaN
Jun     205  60.0

Series versus 1-column DataFrame

In [ ]:
 df['eggs']

month
Jan     47
Feb    110
Mar    221
Apr     77
May    132
Jun    205
Name: eggs, dtype: int64

In [ ]:
type(df['eggs'])

pandas.core.series.Series

In [ ]:
df[['eggs']]

       eggs
month
Jan      47
Feb     110
Mar     221
Apr      77
May     132
Jun     205

In [ ]:
type(df[['eggs']])

pandas.core.frame.DataFrame

#Filtering DataFrames

Creating a Boolean Series

In [ ]:
df[['salt','eggs']] > 60

        salt   eggs
month
Jan    False  False
Feb    False   True
Mar     True   True
Apr     True   True
May    False   True
Jun    False   True

Filtering with a Boolean Series

In [ ]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
 df[df.salt > 60]

       eggs  salt  spam
month
Mar     221  89.0    72
Apr      77  87.0    20

In [ ]:
enough_salt_sold = df.salt > 60

In [ ]:
enough_salt_sold  #this is a series

month
Jan    False
Feb    False
Mar     True
Apr     True
May    False
Jun    False
Name: salt, dtype: bool

In [ ]:
type(df[enough_salt_sold] )

pandas.core.frame.DataFrame

In [ ]:
type(df.salt > 60)

pandas.core.series.Series

Combining filters

In [ ]:
(df.salt >= 50) & (df.eggs < 200)

month
Jan    False
Feb     True
Mar    False
Apr     True
May    False
Jun    False
dtype: bool

In [ ]:
 df[(df.salt >= 50) & (df.eggs < 200)] # Both conditions

       eggs  salt  spam
month
Feb     110  50.0    31
Apr      77  87.0    20

In [ ]:
(df.salt >= 50) | (df.eggs < 200)

month
Jan    True
Feb    True
Mar    True
Apr    True
May    True
Jun    True
dtype: bool

In [ ]:
 df[(df.salt >= 50) | (df.eggs < 200)] # Either condition

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

DataFrames with zeros and NaNs

In [ ]:
df2 = df.copy()
df2

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
 df2['bacon'] = [0, 0, 50, 60, 70, 80] 
 df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

In [ ]:
df3=df2.copy()
df3

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

DataFrame Append

In [ ]:
other = pd.DataFrame({'eggs': ['K0', 'K1', 'K2'],
                      'salt': ['b10', 'b20', 'b50'],
                      'spam': ['s1', 's2', 's3'],
                      'bacon': ['bc0', 'bc1', 'cb2']},index=["July", "Aug", "Sept"])
other

     eggs salt spam bacon
July   K0  b10   s1   bc0
Aug    K1  b20   s2   bc1
Sept   K2  b50   s3   cb2

In [ ]:
df2.append(other)

     eggs salt spam bacon
Jan    47   12   17     0
Feb   110   50   31     0
Mar   221   89   72    50
Apr    77   87   20    60
May   132  NaN   52    70
Jun   205   60   55    80
July   K0  b10   s1   bc0
Aug    K1  b20   s2   bc1
Sept   K2  b50   s3   cb2

DataFrame Join

In [ ]:
df3

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

In [ ]:
df3.columns=['new_col1', 'new_col2', 'new_Col3','new_col4']
df3

       new_col1  new_col2  new_Col3  new_col4
month
Jan          47      12.0        17         0
Feb         110      50.0        31         0
Mar         221      89.0        72        50
Apr          77      87.0        20        60
May         132       NaN        52        70
Jun         205      60.0        55        80

In [ ]:
df3.drop("new_col4",axis=1,inplace=True)
df3

       new_col1  new_col2  new_Col3
month
Jan          47      12.0        17
Feb         110      50.0        31
Mar         221      89.0        72
Apr          77      87.0        20
May         132       NaN        52
Jun         205      60.0        55

In [ ]:
df2.join(df3)

       eggs  salt  spam  bacon  new_col1  new_col2  new_Col3
month
Jan      47  12.0    17      0        47      12.0        17
Feb     110  50.0    31      0       110      50.0        31
Mar     221  89.0    72     50       221      89.0        72
Apr      77  87.0    20     60        77      87.0        20
May     132   NaN    52     70       132       NaN        52
Jun     205  60.0    55     80       205      60.0        55

Select columns with all nonzeros

In [ ]:
df2

       eggs  salt  spam  bacon
month
Jan      47  12.0    17      0
Feb     110  50.0    31      0
Mar     221  89.0    72     50
Apr      77  87.0    20     60
May     132   NaN    52     70
Jun     205  60.0    55     80

In [ ]:
df2.loc[:, df2.all()]

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

Select columns with any NaNs

In [ ]:
df.loc[:, df.isnull().any()]

       salt
month
Jan    12.0
Feb    50.0
Mar    89.0
Apr    87.0
May     NaN
Jun    60.0

Select columns without NaNs

In [ ]:
df

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52
Jun     205  60.0    55

In [ ]:
df.loc[:, df.notnull().all()]

       eggs  spam
month
Jan      47    17
Feb     110    31
Mar     221    72
Apr      77    20
May     132    52
Jun     205    55

Drop rows with any NaNs

In [ ]:
df.dropna(how='any')

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
Jun     205  60.0    55

In [ ]:
from google.colab import drive
drive.mount('/content/drive',)

In [ ]:
df

In [ ]:
df.salt > 55

Filtering a column based on another

In [ ]:
df.eggs[df.salt > 55]  #returns a series